#include <iostream>
using namespace std;

/*
Написать функцию, которая, находит минимум и максимум (значение и номер элемента) в массиве целых чисел.

*/

void main() {
	setlocale(LC_CTYPE, "Rus");

	//Код программы

	

	cout << endl;
	system("pause");
}