#include <iostream>

using namespace std;

void main() {
	setlocale(LC_CTYPE, "Rus");

	/*
	—тоимость проезда в маршрутке Ц 7000 руб.  оличество сид€чих мест Ц 20.  оличество сто€чих Ц 10. «а день 50% поездок маршрутка полностью наполнена,
	30% - заполнены только сид€чие места, 20% - половина сид€чих мест пуста.
	а) пользователь вводит количество поездок за день, посчитать общую прибыль.
	б) пользователь вводит рассто€ние одной поездки, стоимость бензина и расход бензина. ѕосчитать прибыль с учетом расходов на бензин.

	*/

	// од программы

	int i = 1;
	while (i % 5 != 0)
	{
		{
			cout << i;
		}
		i++;
	}

	cout << endl;
	system("pause");
}