#include <iostream>

using namespace std;

void main() {
	setlocale(LC_CTYPE, "Rus");

	/*

	*/

	//Код программы

	char s[421] = "ЖЫБЙЩААЙЪАВИЙШСЕПФЧЖК_МАОГ_АУЫЯАЬЫРЫ_ХРББДСМОЯТЯЧГГЛПЮНЩОФ_ЖККЪИ_ДФЙОЫЯПЭВЮЬДЫ_ИЬНЖЫБГГЛЭЬВНСТТЫЬШЬЙААБЦФТЪВО_ЪРОФД_БДС_ФЬВНСАФЬАОСИПТАЛЧ_ЗГЮУЖЫРШВКЯАФЙУ__ДОГФЪЦЫСЗЙТДБФТАЙЪОЩОФЯВЪОВР_ЭЯСЭФГАЛЭХ__ЬНЖЫЩАЮЗБ_ЪЕПИЪЙЬ_МРОЕВНЯАЫМАХСМЭД_ЮЙЯЪЫАШЭАВАЯЬЫЫСКФЬЦБФВТЗЧТЪЫЮЕЭЧАУЮГОЧЪМАУЯСЧАЯИЭЦ_ЫБББЬСЮЧИЧССЙЬЫСКЭГМЖПРГЫЯУЦГЭГЪЯЬУЭЦОББАУАВНПХЭЪНТЯЬЫТВЮЭФ__БТААЯШЦЮЧЩЧИЧССИЭТЪРОББЙЮЕВЕЬУРЫ_Б_МЭФЯЙ_ДНЫСШВЧЫУСЙТВТИЧЙЧИЬУСВПХГЛПКЯГФТУ";
	char a[34] = "АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ_";
	char key[5] = "ПУТЬ";

	int n;

	for (int i = 0; i < 420; i++) {									//Цикл по тексту
		for (int k = 0; k < 4; k++) {								//Вычисляем позицию ключа для текущего символа
			if (i % 4 == k) {										
				for (int j = 0; j < 33; j++) {						//Цикл по алфавиту
					if (s[i] == a[j]) {								//Если символ текста совпадает с символом алфавита
						for (n = 0; n < 33; n++) {				
							if (key[k] == a[n]) break;				//Вычисляем порядковый номер символа ключа в алфавите
						}
						s[i] = (j - n < 0) ? a[j - n + 33] : a[j - n];		//Сдвигаем на порядковый номер ключа 
						break;
					}
				}
				break;
			}
		}
		cout << s[i];
	}

	cout << endl;
	system("pause");
}